[
    {
        "id":"nor_city_road_nondisplay",
        "name":"nor_city_road_nondisplay",
        "stages":[
            {
                "progress":10,
                "logText":"Notice bones are children"
            },
            {
                "progress":15,
                "logText":"Sargeant says they searched the basement but didn't find diary"
            },
            {
                "progress":20,
                "logText":"Drunken Duck bed"
            },
            {
                "progress":30,
                "logText":"Got ripped off."
            },
            {
                "progress":40,
                "logText":"Dirhan gone"
            },
            {
                "progress":50,
                "logText":"Told Balon investigation is solved."
            },
            {
                "progress":60,
                "logText":"Complained to Umar"
            },
            {
                "progress":70,
                "logText":"Caladrius spawned"
            },
            {
                "progress":71,
                "logText":"On nor_city_road9a"
            },
            {
                "progress":72,
                "logText":"Interacted with Caladrius"
            },
            {
                "progress":75,
                "logText":"Attacked Caladrius"
            }
        ]
    },
    {
        "id":"essence_child",
        "name":"Essence of a child",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"The Duleian road is closed. The guard at the checkpoint told me there is an ongoing investigation, but would not say more. He suggested I talk to the sergeant at the camp back up the road a little."
            },
            {
                "progress":15,
                "logText":"I spoke to a guard at a camp by the side of the Duleian road. He told me the road is closed because of an ongoing investigation, but would not say more. He suggested I speak to the sergeant at the camp."
            },
            {
                "progress":16,
                "logText":"I spoke to the sergeant at a camp by the side of the Duleian road. He told me the road is closed because of an ongoing investigation, but would not say more. I need to prove that I can help them."
            },
            {
                "progress":20,
                "logText":"I spoke to the sergeant at a camp by the side of the Duleian road. He told me the road is closed because of an ongoing investigation into missing childen. I persuaded him that I can help, so he gave me a pass to get through the road block."
            },
            {
                "progress":25,
                "logText":"The sergeant told me that there have been an unusually large number of children disappearing around here, but that have not found much to indicate why. They haven't tried very hard though."
            },
            {
                "progress":30,
                "logText":"I showed the guard at the road block my pass from the sergeant, and I can now go through."
            },
            {
                "progress":40,
                "logText":"I have found a child's toy in an old tomb. The toy does not look very old. Maybe this is a clue."
            },
            {
                "progress":50,
                "logText":"I took one of the small bones from the tomb as evidence."
            },
            {
                "progress":60,
                "logText":"I found a child's diary in the basement of the old women's shack. I should ask them about where this came from."
            },
            {
                "progress":70,
                "logText":"I asked the old women about the diary. They told me they found it in the woods months ago. They brought it back in case the owner came looking for it, but so far nobody has asked for it."
            },
            {
                "progress":80,
                "logText":"I showed the evidence I had found to the sargeant at the camp. He said it is not enough for them to act on, so I should continue investigating. I should ask around in Sullengard."
            },
            {
                "progress":100,
                "logText":"End 1",
                "rewardExperience":10,
                "finishesQuest":1
            },
            {
                "progress":110,
                "logText":"End 2",
                "rewardExperience":10,
                "finishesQuest":1
            },
            {
                "progress":120,
                "logText":"End 3",
                "rewardExperience":10,
                "finishesQuest":1
            }
        ]
    }
]